# 1. Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.


#spisok = [99, -77, 12.5, 'str', False, None]


def type_chek(el):364
    for el in range(len(spisok)):
        print(type(spisok[el]))
    return


type_chek(spisok)


